In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('adult.data.csv',
                 delimiter=',',
                )

# Need to Finish, highest earning country, highest earning country percentage and fix percentage without higher education that earn >50K

#  How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

# Sort Race

In [3]:
df['race'].value_counts().sort_index()

Amer-Indian-Eskimo      311
Asian-Pac-Islander     1039
Black                  3124
Other                   271
White                 27816
Name: race, dtype: int64

# Sort Sexs

In [4]:
sorted_sexs = df['sex'].value_counts().sort_index() # sorts the sexs and counts them 
sorted_sexs

Female    10771
Male      21790
Name: sex, dtype: int64

# What is the average age of men?

In [5]:
round(df.groupby(['sex']).get_group('Male').mean()[0], 1)

C:\Users\Woodzi\AppData\Local\Temp\ipykernel_22404\716992192.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  round(df.groupby(['sex']).get_group('Male').mean()[0], 1)

39.4

# Number of People with Higher Ed and Make >50K

In [6]:
higher_ed_Over_50 = df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))]
higher_ed_Over_50

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
11,30,State-gov,141297,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K
19,43,Self-emp-not-inc,292175,Masters,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
20,40,Private,193524,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,60,United-States,>50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32533,54,Private,337992,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Asian-Pac-Islander,Male,0,0,50,Japan,>50K
32536,34,Private,160216,Bachelors,13,Never-married,Exec-managerial,Not-in-family,White,Female,0,0,55,United-States,>50K
32538,38,Private,139180,Bachelors,13,Divorced,Prof-specialty,Unmarried,Black,Female,15020,0,45,United-States,>50K
32539,71,?,287372,Doctorate,16,Married-civ-spouse,?,Husband,White,Male,0,0,10,United-States,>50K
32554,53,Private,321865,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K

In [7]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sum())

education
Bachelors       2221
HS-grad         1675
11th              60
Masters          959
9th               27
Some-college    1387
Assoc-acdm       265
Assoc-voc        361
7th-8th           40
Doctorate        306
Prof-school      423
5th-6th           16
10th              62
1st-4th            6
Preschool          0
12th              33
Name: salary, dtype: int64

In [8]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sum()) # .values.sum()

education
Bachelors       3134
HS-grad         8826
11th            1115
Masters          764
9th              487
Some-college    5904
Assoc-acdm       802
Assoc-voc       1021
7th-8th          606
Doctorate        107
Prof-school      153
5th-6th          317
10th             871
1st-4th          162
Preschool         51
12th             400
Name: salary, dtype: int64

In [9]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sum()).values.sum()

7841

In [10]:
df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sum()).values.sum()

24720

In [11]:
# the 2 above lines do add up to 32,561
df.shape

(32561, 15)

In [12]:
df_groupby = df.groupby('education')
df_column = df_groupby[['salary']]
df_column.tail()

      salary
31798  <=50K
32008  <=50K
32035  <=50K
32044  <=50K
32153  <=50K
...      ...
32556  <=50K
32557   >50K
32558  <=50K
32559  <=50K
32560   >50K

[80 rows x 1 columns]

# What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [13]:
num_min_workers = df.loc[(df['hours-per-week'] < 40) & (df['salary'] == '>50K')]
num_min_workers = round(len(num_min_workers)/len(df)*100, 1)
num_min_workers
# .size() might be an issue, it counts NA/null values that could be throwing off my percentages

2.3

# What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [14]:
num_min_hours_over_50 = df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')] 
len(num_min_hours_over_50)

2

In [15]:
# Percentage of rich among those who work fewest hours

In [16]:
sum_work_1hr = len(df.loc[(df['hours-per-week'] == 1)])
len_num_min_hours_over_50 = len(df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')])
rich_percentage = round(len_num_min_hours_over_50/sum_work_1hr*100, 1)
rich_percentage

10.0

In [17]:
len_higher_ed_Over_50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))])
len_higher_ed_Over_50

3486

In [18]:
len_all_over_50 = len(df.loc[(df['salary'] == '>50K')])
len_all_over_50

7841

# What country has the highest percentage of people that earn >50K?

In [19]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [20]:
# How do I add all the countries?

In [21]:
over_50_con = df.groupby("native-country", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sort_index().sum()).nlargest()
# returns country with highest number of rich
over_50_con.head(10)

native-country
United-States    7171
?                 146
Philippines        61
Germany            44
India              40
Name: salary, dtype: int64

In [22]:
# df.groupby(['sex']).get_group('Male').mean()
# df.groupby(['native-country', 'salary'], sort=True).sum()
under_50_con = df.groupby("native-country", sort=False)["salary"].apply(lambda ser: ser.str.contains("<=50K").sort_index().sum()).nlargest()
# ************************************************************************************************

In [23]:
under_50_con

native-country
United-States    21999
Mexico             610
?                  437
Philippines        137
Puerto-Rico        102
Name: salary, dtype: int64

In [24]:
  len_higher_ed_Over_50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '>50K')) | ((df['education'] == 'Masters') & (df['salary'] == '>50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '>50K'))])
  len_higher_ed_un50 = len(df.loc[((df['education'] == 'Bachelors') & (df['salary'] == '<=50K')) | ((df['education'] == 'Masters') & (df['salary'] == '<=50K')) | ((df['education'] == 'Doctorate') & (df['salary'] == '<=50K'))])
  len_all_higher_ed = len_higher_ed_un50 + len_higher_ed_Over_50
  higher_education_rich = round(len_higher_ed_Over_50/len_all_higher_ed*100, 1)

In [25]:
len_higher_ed_Over_50

3486

In [26]:
  # What percentage of people without advanced education (Bachelors, Masters, or Doctorate) make more than 50K?
  # **************************************************************************************************

In [27]:
all_ed_over_50 = df.groupby('education')['salary'].apply(lambda x: x.str.contains('>50K').sort_index().sum())
all_ed_over_50

education
10th              62
11th              60
12th              33
1st-4th            6
5th-6th           16
7th-8th           40
9th               27
Assoc-acdm       265
Assoc-voc        361
Bachelors       2221
Doctorate        306
HS-grad         1675
Masters          959
Preschool          0
Prof-school      423
Some-college    1387
Name: salary, dtype: int64

In [28]:
mask_miss   = ~df.loc[:, 'education'].str.contains('Bachelors')
mask_mrs    = ~df.loc[:, 'education'].str.contains('Doctorate')
mask_master = ~df.loc[:, 'education'].str.contains('Masters')
fifty_K = ~df.loc[:, 'salary'].str.contains('<=50K')
len_df = len(df)
total_o_50_bad_ed = len(df.loc[mask_miss & mask_mrs & mask_master & fifty_K, ('education', 'salary')])
lower_education_rich = round(total_o_50_bad_ed/len_df*100, 1)
df.loc[mask_miss & mask_mrs & mask_master & fifty_K, ('education', 'salary')]

          education salary
7           HS-grad   >50K
10     Some-college   >50K
14        Assoc-voc   >50K
27     Some-college   >50K
38     Some-college   >50K
...             ...    ...
32518       HS-grad   >50K
32519  Some-college   >50K
32545    Assoc-acdm   >50K
32557       HS-grad   >50K
32560       HS-grad   >50K

[4355 rows x 2 columns]

In [29]:
education = df.loc[:, 'education']
salary = df.loc[:, 'salary'].str.contains('>50K')
both = df.loc[salary, ('education', 'salary')]
both

          education salary
7           HS-grad   >50K
8           Masters   >50K
9         Bachelors   >50K
10     Some-college   >50K
11        Bachelors   >50K
...             ...    ...
32539     Doctorate   >50K
32545    Assoc-acdm   >50K
32554       Masters   >50K
32557       HS-grad   >50K
32560       HS-grad   >50K

[7841 rows x 2 columns]

total_o_50_bad_ed

In [30]:
len_df

32561

In [31]:
over_50_total = df.groupby("education", sort=False)["salary"].apply(lambda ser: ser.str.contains(">50K").sort_index().sum()).nlargest()
over_50_total.head(20)

education
Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Name: salary, dtype: int64

In [32]:
highest_earning_country = None
highest_earning_country_percentage = None

# Identify the most popular occupation for those who earn >50K in India.

In [33]:
finding_occupation_India = df[(df['native-country'] == 'India') & (df['salary'] == '>50K')]
finding_max_occ = df['occupation'].value_counts()
finding_max_occ.index[0]

'Prof-specialty'

# Setting the index to be education the salary

In [34]:
si = df.set_index(['education', 'salary'])
all_salary_over_50 = df.loc[lambda df: df['salary'] == '>50K']

# What country has the highest percentage of people that earn >50K?

In [36]:
# getting all salaries over 50
salaries_o50 = df[(df['salary'] == '>50K')]
# getting all salaries under 50
salaries_un50 = df[(df['salary'] == '<=50K')]

o50c = salaries_o50[['native-country', 'salary']]
un50c = salaries_un50[['native-country', 'salary']]
o50c

      native-country salary
7      United-States   >50K
8      United-States   >50K
9      United-States   >50K
10     United-States   >50K
11             India   >50K
...              ...    ...
32539  United-States   >50K
32545  United-States   >50K
32554  United-States   >50K
32557  United-States   >50K
32560  United-States   >50K

[7841 rows x 2 columns]

In [74]:
salary_countries_sorted = df[['native-country', 'salary']].value_counts().sort_index()
o=0
n=1
salary = df.groupby(['native-country', 'salary'])['salary'].count()
salary
for a in (salary.index):
    print(a)
# sorting and counting using groupbyfor a,b in zip(countries_o50.index, countries_un50.index):
# missing 
# ('Outlying-US(Guam-USVI-etc)', '<=50K')
# ('Holand-Netherlands', '<=50K')
type(salary)

('?', '<=50K')
('?', '>50K')
('Cambodia', '<=50K')
('Cambodia', '>50K')
('Canada', '<=50K')
('Canada', '>50K')
('China', '<=50K')
('China', '>50K')
('Columbia', '<=50K')
('Columbia', '>50K')
('Cuba', '<=50K')
('Cuba', '>50K')
('Dominican-Republic', '<=50K')
('Dominican-Republic', '>50K')
('Ecuador', '<=50K')
('Ecuador', '>50K')
('El-Salvador', '<=50K')
('El-Salvador', '>50K')
('England', '<=50K')
('England', '>50K')
('France', '<=50K')
('France', '>50K')
('Germany', '<=50K')
('Germany', '>50K')
('Greece', '<=50K')
('Greece', '>50K')
('Guatemala', '<=50K')
('Guatemala', '>50K')
('Haiti', '<=50K')
('Haiti', '>50K')
('Holand-Netherlands', '<=50K')
('Honduras', '<=50K')
('Honduras', '>50K')
('Hong', '<=50K')
('Hong', '>50K')
('Hungary', '<=50K')
('Hungary', '>50K')
('India', '<=50K')
('India', '>50K')
('Iran', '<=50K')
('Iran', '>50K')
('Ireland', '<=50K')
('Ireland', '>50K')
('Italy', '<=50K')
('Italy', '>50K')
('Jamaica', '<=50K')
('Jamaica', '>50K')
('Japan', '<=50K')
('Japan', '>50K')
('Laos', '<=50K')
('Laos', '>50K')
('Mexico', '<=50K')
('Mexico', '>50K')
('Nicaragua', '<=50K')
('Nicaragua', '>50K')
('Outlying-US(Guam-USVI-etc)', '<=50K')
('Peru', '<=50K')
('Peru', '>50K')
('Philippines', '<=50K')
('Philippines', '>50K')
('Poland', '<=50K')
('Poland', '>50K')
('Portugal', '<=50K')
('Portugal', '>50K')
('Puerto-Rico', '<=50K')
('Puerto-Rico', '>50K')
('Scotland', '<=50K')
('Scotland', '>50K')
('South', '<=50K')
('South', '>50K')
('Taiwan', '<=50K')
('Taiwan', '>50K')
('Thailand', '<=50K')
('Thailand', '>50K')
('Trinadad&Tobago', '<=50K')
('Trinadad&Tobago', '>50K')
('United-States', '<=50K')
('United-States', '>50K')
('Vietnam', '<=50K')
('Vietnam', '>50K')
('Yugoslavia', '<=50K')
('Yugoslavia', '>50K')

pandas.core.series.Series

# Finding Missing Data

In [75]:
missing_data = pd.DataFrame(salary_countries_sorted).isnull()
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

0
False    82
Name: 0, dtype: int64

In [76]:
# Will try .get_groups

In [77]:
sal_un_50 = ~df.loc[:, 'salary'].str.contains('<=50K') 
salun50countries = df.loc[sal_un_50, ('native-country')].value_counts(sort=False).sort_index(ascending=False)
sal_o_50 = ~df.loc[:, 'salary'].str.contains('>50K') 
salo50countries = df.loc[sal_o_50, ('native-country')].value_counts(sort=False).sort_index(ascending=False)
salo50countries.keys()

Index(['Yugoslavia', 'Vietnam', 'United-States', 'Trinadad&Tobago', 'Thailand',
       'Taiwan', 'South', 'Scotland', 'Puerto-Rico', 'Portugal', 'Poland',
       'Philippines', 'Peru', 'Outlying-US(Guam-USVI-etc)', 'Nicaragua',
       'Mexico', 'Laos', 'Japan', 'Jamaica', 'Italy', 'Ireland', 'Iran',
       'India', 'Hungary', 'Hong', 'Honduras', 'Holand-Netherlands', 'Haiti',
       'Guatemala', 'Greece', 'Germany', 'France', 'England', 'El-Salvador',
       'Ecuador', 'Dominican-Republic', 'Cuba', 'Columbia', 'China', 'Canada',
       'Cambodia', '?'],
      dtype='object')

# Counting number of times you have a Masters and make over >50K

select "native-country", education, salary 
	from adult_data
	where education = (select education from adult_data where education = "Masters");
this is same as below code in SQL

In [39]:
masters_ed_over50 = df.loc[df['education'] ==  'Masters', ['salary']] == '>50k'
masters_ed_over50.salary.value_counts()
masters_ed_over50.value_counts()

salary
False     1723
dtype: int64

In [40]:
  # df.loc[lambda df: df['education'] == 'Bachelors']

In [66]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [141]:
df.loc[['native-country', 'salary']]

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\interactiveshell.py", line 3433, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\Woodzi\AppData\Local\Temp\ipykernel_22404\1120303245.py", line 1, in <module>
    df.loc[['native-country', 'salary']]
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexing.py", line 1073, in __getitem__
    return self._getitem_axis(maybe_callable, axis=axis)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexing.py", line 1301, in _getitem_axis
    return self._getitem_iterable(key, axis=axis)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexing.py", line 1239, in _getitem_iterable
    keyarr, indexer = self._get_listlike_indexer(key, axis)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexing.py", line 1432, in _get_listlike_indexer
    keyarr, indexer = ax._get_indexer_strict(key, axis_name)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexes\base.py", line 6113, in _get_indexer_strict
    self._raise_if_missing(keyarr, indexer, axis_name)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\indexes\base.py", line 6173, in _raise_if_missing
    raise KeyError(f"None of [{key}] are in the [{axis_name}]")
KeyError: "None of [Index(['native-country', 'salary'], dtype='object')] are in the [index]"

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\interactiveshell.py", line 2052, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\ultratb.py", line 1118, in structured_traceback
    return FormattedTB.structured_traceback(
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\ultratb.py", line 1012, in structured_traceback
    return VerboseTB.structured_traceback(
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\ultratb.py", line 865, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\ultratb.py", line 818, in format_exception_as_a_whole
    frames.append(self.format_record(r))
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\ultratb.py", line 736, in format_record
    result += ''.join(_format_traceback_lines(frame_info.lines, Colors, self.has_colors, lvals))
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\core.py", line 734, in lines
    pieces = self.included_pieces
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\core.py", line 677, in included_pieces
    scope_pieces = self.scope_pieces
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\utils.py", line 144, in cached_property_wrapper
    value = obj.__dict__[self.func.__name__] = self.func(obj)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\core.py", line 614, in scope_pieces
    scope_start, scope_end = self.source.line_range(self.scope)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\stack_data\core.py", line 178, in line_range
    return line_range(self.asttext(), node)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\executing\executing.py", line 428, in asttext
    self._asttext = ASTText(self.text, tree=self.tree, filename=self.filename)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\asttokens\asttokens.py", line 307, in __init__
    super(ASTText, self).__init__(source_text, filename)
  File "C:\Users\Woodzi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\asttokens\asttokens.py", line 44, in __init__
    source_text = six.ensure_text(source_text)
AttributeError: module 'six' has no attribute 'ensure_text'

In [139]:
ed_country_salary = df.drop(columns=['age', 'workclass', 'fnlwgt', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'education'])
grouped = ed_country_salary.groupby(["native-country"]).value_counts().sort_index()

country_salary_count = dict()
for b in grouped.index:
    print(b)
    if b[0] in country_salary_count:
        country_salary_count[b[0]] += 1
    else:
        country_salary_count[b[0]] = 1
grouped

('?', '<=50K')
('?', '>50K')
('Cambodia', '<=50K')
('Cambodia', '>50K')
('Canada', '<=50K')
('Canada', '>50K')
('China', '<=50K')
('China', '>50K')
('Columbia', '<=50K')
('Columbia', '>50K')
('Cuba', '<=50K')
('Cuba', '>50K')
('Dominican-Republic', '<=50K')
('Dominican-Republic', '>50K')
('Ecuador', '<=50K')
('Ecuador', '>50K')
('El-Salvador', '<=50K')
('El-Salvador', '>50K')
('England', '<=50K')
('England', '>50K')
('France', '<=50K')
('France', '>50K')
('Germany', '<=50K')
('Germany', '>50K')
('Greece', '<=50K')
('Greece', '>50K')
('Guatemala', '<=50K')
('Guatemala', '>50K')
('Haiti', '<=50K')
('Haiti', '>50K')
('Holand-Netherlands', '<=50K')
('Honduras', '<=50K')
('Honduras', '>50K')
('Hong', '<=50K')
('Hong', '>50K')
('Hungary', '<=50K')
('Hungary', '>50K')
('India', '<=50K')
('India', '>50K')
('Iran', '<=50K')
('Iran', '>50K')
('Ireland', '<=50K')
('Ireland', '>50K')
('Italy', '<=50K')
('Italy', '>50K')
('Jamaica', '<=50K')
('Jamaica', '>50K')
('Japan', '<=50K')
('Japan', '>50K')
('Laos', '<=50K')
('Laos', '>50K')
('Mexico', '<=50K')
('Mexico', '>50K')
('Nicaragua', '<=50K')
('Nicaragua', '>50K')
('Outlying-US(Guam-USVI-etc)', '<=50K')
('Peru', '<=50K')
('Peru', '>50K')
('Philippines', '<=50K')
('Philippines', '>50K')
('Poland', '<=50K')
('Poland', '>50K')
('Portugal', '<=50K')
('Portugal', '>50K')
('Puerto-Rico', '<=50K')
('Puerto-Rico', '>50K')
('Scotland', '<=50K')
('Scotland', '>50K')
('South', '<=50K')
('South', '>50K')
('Taiwan', '<=50K')
('Taiwan', '>50K')
('Thailand', '<=50K')
('Thailand', '>50K')
('Trinadad&Tobago', '<=50K')
('Trinadad&Tobago', '>50K')
('United-States', '<=50K')
('United-States', '>50K')
('Vietnam', '<=50K')
('Vietnam', '>50K')
('Yugoslavia', '<=50K')
('Yugoslavia', '>50K')

native-country  salary
?               <=50K      437
                >50K       146
Cambodia        <=50K       12
                >50K         7
Canada          <=50K       82
                          ...
United-States   >50K      7171
Vietnam         <=50K       62
                >50K         5
Yugoslavia      <=50K       10
                >50K         6
Length: 82, dtype: int64